public  class  Shirt {
  общедоступный  int shirtID =  5 ; // стандартне значення номера моделі сорочки
  общедоступное  описание строки =  " R " ;
  public  String color =  " Красный " ; // стандартный опис сорочки
  // коды кольорів: R = червоний, B = синій, G = зелений, U = невідомо
  // общедоступный символ colorCode = 'U';
  публичная  двойная цена =  21,2 ; // стандартна вартість сорочки
  public  int amountInStock =  0 ; // стандартное количество на складі
  
  // цей метод просто виводить всю інформацію про сорочку на екран
  public  void  displayShirtInformation () {
    Система . из . println ( " Идентификатор рубашки: "  + идентификатор рубашки);
    Система . из . println ( " Описание рубашки: "  + описание);
    Система . из . println ( " Цвет: "  + цвет);
    Система . из . println ( " Цена рубашки: $ "  + цена);
    Система . из . println ( " Количество на складе: "  + amountInStock);
  } // кінець методу displayShirtInformation
} // кінець опису класу
